app/Models/UtilisateurModel.php

    public function getUtilisateurByUsername($username) {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `utilisateur`
WHERE `username` = 'Hanaa'
 LIMIT 1